Tekla.Structures.Model.NumberingSeries
The NumberingSeries class describes how an object is to be numbered.

Tekla.Structures.Model.NumberingSeries.Prefix
The prefix in numbering.

Tekla.Structures.Model.NumberingSeries.StartNumber
The start number in numbering.

Tekla.Structures.Model.NumberingSeries.#ctor
Instantiates a default numbering.

Tekla.Structures.Model.NumberingSeries.#ctor(System.String,System.Int32)
Instantiates a numbering series with the given arguments.
Prefix: The prefix to be used.
Number: The start number to be used.